app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    @user.email = params[:user][:email]
    if @user.save
---
INSERT INTO "users" ("email", "created_at", "updated_at") VALUES (NULL, '2011-04-01 22:00:43.182154', '2011-04-01 22:00:43.182154')